# OwnElementsOutOfDate Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..EditingFailures..::..OwnElementsOutOfDate Property
BuiltInFailures..::..EditingFailures Class See Also
---
You now own the element, but your file is out of date. You must Reload Latest before editing the element.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId OwnElementsOutOfDate { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property OwnElementsOutOfDate As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ OwnElementsOutOfDate {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..EditingFailures Class
Autodesk.Revit.DB Namespace